/*
 * =====================================================================================
 * 
 *     Modulename:
 *       Filename:  maibu_debug_sdk.h
 *
 *    Description:  
 *    Corporation:
 * 
 *         Author:  gliu (), gliu@damaijiankang.com
 *        Created:  2015年10月22日 17时49分29秒
 *
 * =====================================================================================
 */

#ifndef _MAIBU_DEBUG_SDK_H
#define _MAIBU_DEBUG_SDK_H




/*
 *--------------------------------------------------------------------------------------
 *     function:  maibu_print_log
 *    parameter:  日志信息
 *       return:
 *  description:  写日志
 * 	  other:	  在应用中使用该接口保存日志信息后，需要在应用商店下载专门的debug应用去查看日志信息
 *--------------------------------------------------------------------------------------
 */
extern void maibu_print_log(char * log);




/*
 *--------------------------------------------------------------------------------------
 *     function:  maibu_clear_log
 *    parameter: 
 *       return:
 *  description:  清楚日志
 * 	  other:      系统会专门提供一块区域用来保存所有应用的日志信息，
 *				  大小500字节，超过则会覆盖保存，建议单独调试某一应用时，先使用该接口清除
 *--------------------------------------------------------------------------------------
 */
extern void maibu_clear_log(void);











































#endif
